EDT/УТ/src/Catalogs/ВидыОплатЧекаККМ/ВидыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатЧекаККМ</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
  </predefined>
  <attributes>
    <name>УдалитьВидДенежныхСредств</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатЧекаККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетовБанкаКредитора</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/ВидыОплатЧекаККМ/ObjectModule.bsl
// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не (ЭтоГруппа Или ОбменДанными.Загрузка) Тогда
		Если НЕ ЗначениеЗаполнено(ТипОплаты) Тогда
			СтрокаСообщения = "Не заполнено значение реквизита ""Тип оплаты""!";
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, "Справочник: Виды оплат чека ККМ");
		КонецЕсли;

		Если ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
			Если НЕ ЗначениеЗаполнено(БанкКредитор) Тогда
				СтрокаСообщения = "Не заполнено значение реквизита ""Банк-кредитор""!";
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, "Справочник: Виды оплат чека ККМ");
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетовБанкаКредитора) Тогда
				СтрокаСообщения = "Не заполнено значение реквизита ""Договор взаиморасчетов""!";
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, "Справочник: Виды оплат чека ККМ");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
